# Extract

In [4]:
import pandas as pd

In [5]:
df = pd.read_csv("C:/Users/Amantia/Downloads/archive/Sales Transaction v.4a.csv")
df.head()

,TransactionNo,Date,ProductNo,ProductName,Price,Quantity,CustomerNo,Country
0,581482,12/9/2019,22485,Set Of 2 Wooden Market Crates,21.47,12,17490.0,United Kingdom
1,581475,12/9/2019,22596,Christmas Star Wish List Chalkboard,10.65,36,13069.0,United Kingdom
2,581475,12/9/2019,23235,Storage Tin Vintage Leaf,11.53,12,13069.0,United Kingdom
3,581475,12/9/2019,23272,Tree T-Light Holder Willie Winkie,10.65,12,13069.0,United Kingdom
4,581475,12/9/2019,23239,Set Of 4 Knick Knack Tins Poppies,11.94,6,13069.0,United Kingdom

In [6]:
df.shape

(536350, 8)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 536350 entries, 0 to 536349
Data columns (total 8 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   TransactionNo  536350 non-null  object
 1   Date           536350 non-null  object
 2   ProductNo      536350 non-null  object
 3   ProductName    536350 non-null  object
 4   Price          536350 non-null  float64
 5   Quantity       536350 non-null  int64
 6   CustomerNo     536295 non-null  float64
 7   Country        536350 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 32.7+ MB

# Transform

### Standarize cols

In [8]:
df = df.rename(columns={"TransactionNo": "transaction_id", "Date": "date", "ProductNo": "product_id",
                        "ProductName": "name", "Price": "price", "Quantity": "quantity", 
                        "CustomerNo": "customer_id", "Country": "country"})

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 536350 entries, 0 to 536349
Data columns (total 8 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   transaction_id  536350 non-null  object
 1   date            536350 non-null  object
 2   product_id      536350 non-null  object
 3   name            536350 non-null  object
 4   price           536350 non-null  float64
 5   quantity        536350 non-null  int64
 6   customer_id     536295 non-null  float64
 7   country         536350 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 32.7+ MB

### Drop data duplicate

In [10]:
df.duplicated().sum()

np.int64(5200)

In [11]:
df.drop_duplicates(keep='first', inplace=True)

In [12]:
df.duplicated().sum()

np.int64(0)

### Handling Missing Value

In [13]:
df.isnull().sum()

transaction_id     0
date               0
product_id         0
name               0
price              0
quantity           0
customer_id       55
country            0
dtype: int64

In [14]:
df[df['customer_id'].isnull()].head()

,transaction_id,date,product_id,name,price,quantity,customer_id,country
6511,C581406,12/8/2019,46000M,Polyester Filler Pad 45x45cm,6.19,-240,NaN,United Kingdom
6512,C581406,12/8/2019,46000S,Polyester Filler Pad 40x40cm,6.19,-300,NaN,United Kingdom
90098,C575153,11/8/2019,22947,Wooden Advent Calendar Red,44.25,-1,NaN,United Kingdom
102671,C574288,11/3/2019,22178,Victorian Glass Hanging T-Light,25.37,-1,NaN,United Kingdom
117263,C573180,10/28/2019,23048,Set Of 10 Lanterns Fairy Light Star,14.50,-1,NaN,United Kingdom

In [ ]:
df['customer_id'].fillna(0, inplace=True)

In [16]:
df.isnull().sum()

transaction_id    0
date              0
product_id        0
name              0
price             0
quantity          0
customer_id       0
country           0
dtype: int64

### Dealing with Unmatched Data

In [17]:
df.loc[
    df["transaction_id"].str.contains("C")
].shape

(8548, 8)

In [18]:
c_trans = df.loc[
    df["transaction_id"].str.contains("C")
].index

In [19]:
df.drop(c_trans, inplace=True)

In [20]:
df.loc[
    df["quantity"] <= 0
].shape

(0, 8)

In [21]:
df.shape

(522602, 8)

### Data Type Casting

In [22]:
df = df.astype({"transaction_id": int, "customer_id": int})
df["date"]= pd.to_datetime(df["date"], format="%m/%d/%Y")

In [23]:
df.dtypes

transaction_id             int64
date              datetime64[ns]
product_id                object
name                      object
price                    float64
quantity                   int64
customer_id                int64
country                   object
dtype: object

### Do price fluctuate?

In [24]:
product_unique = df.loc[
    ~df[["product_id", "name", "price"]].duplicated()
]

In [25]:
product_unique.sort_values(by=["name", "date"]).head()

,transaction_id,date,product_id,name,price,quantity,customer_id,country
507047,538877,2018-12-14,22418,10 Colour Spaceboy Pen,12.82,2,14877,United Kingdom
491632,540154,2019-01-05,22418,10 Colour Spaceboy Pen,11.95,2,12154,United Kingdom
130922,572035,2019-10-20,22418,10 Colour Spaceboy Pen,10.99,144,14646,Netherlands
94877,574856,2019-11-07,22418,10 Colour Spaceboy Pen,12.77,2,17856,United Kingdom
52165,578067,2019-11-22,22418,10 Colour Spaceboy Pen,11.92,1,12067,United Kingdom

In [26]:
df[["date","product_id", "name", "price"]].sort_values(by=["name", "date"]).head()

             date product_id                    name  price
533683 2018-12-01      22418  10 Colour Spaceboy Pen  11.12
534531 2018-12-01      22418  10 Colour Spaceboy Pen  11.12
534759 2018-12-01      22418  10 Colour Spaceboy Pen  11.95
535239 2018-12-01      22418  10 Colour Spaceboy Pen  11.12
531338 2018-12-02      22418  10 Colour Spaceboy Pen  11.12

### Sum the quantity if identical transactions occur

In [27]:
type(df.groupby(["transaction_id", "date", "product_id", "name", "price", "customer_id", "country"])["quantity"])

pandas.core.groupby.generic.SeriesGroupBy

In [28]:
df.loc[
    (df["transaction_id"] == 579171) &
    (df["product_id"] == "22897")
]

,transaction_id,date,product_id,name,price,quantity,customer_id,country
35015,579171,2019-11-28,22897,Oven Mitt Apples Design,6.19,4,13030,United Kingdom
35040,579171,2019-11-28,22897,Oven Mitt Apples Design,6.19,2,13030,United Kingdom

In [29]:
df = df.groupby(["transaction_id", "date", "product_id", "name", "price", "customer_id", "country"])["quantity"].sum().reset_index()

In [30]:
df.loc[
    (df["transaction_id"] == 579171) &
    (df["product_id"] == "22897")
]

,transaction_id,date,product_id,name,price,customer_id,country,quantity
484530,579171,2019-11-28,22897,Oven Mitt Apples Design,6.19,13030,United Kingdom,6

### Enriching Data

In [31]:
df["year"] = df['date'].dt.year
df['quarter'] = df['date'].dt.quarter
df['month'] = df['date'].dt.month
df['week'] = df['date'].dt.isocalendar().week
df["day"] = df['date'].dt.day
df["day_name"] = df['date'].dt.day_name()

In [32]:
country_id = df["country"].str.upper().str.slice(stop=3) + df["country"].str.len().astype(str)
df["country_id"] = country_id

In [33]:
df.dtypes

transaction_id             int64
date              datetime64[ns]
product_id                object
name                      object
price                    float64
customer_id                int64
country                   object
quantity                   int64
year                       int32
quarter                    int32
month                      int32
week                      UInt32
day                        int32
day_name                  object
country_id                object
dtype: object

# Load

In [34]:
from sqlalchemy import create_engine, text

In [35]:
engine = create_engine("postgresql://postgres:admin@localhost:5432/AMI")
engine.connect()

### Generate Keys for all dimensional tables

In [36]:
df_customer = df[["customer_id"]].drop_duplicates().sort_values(by="customer_id")
df_customer = df_customer.reset_index(drop=True)
df_customer["customer_key"] = df_customer.index
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4719 entries, 0 to 4718
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   customer_id   4719 non-null   int64
 1   customer_key  4719 non-null   int64
dtypes: int64(2)
memory usage: 73.9 KB

In [37]:
df_transaction = df[["transaction_id"]].drop_duplicates().sort_values(by="transaction_id")
df_transaction = df_transaction.reset_index(drop=True)
df_transaction["transaction_key"] = df_transaction.index
df_transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19790 entries, 0 to 19789
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   transaction_id   19790 non-null  int64
 1   transaction_key  19790 non-null  int64
dtypes: int64(2)
memory usage: 309.3 KB

In [38]:
df_date = df[["date", "year", "quarter", "month", "week", "day", "day_name"]].drop_duplicates().sort_values(by="date")
df_date = df_date.reset_index(drop=True)
df_date["date_key"] = df_date.index
df_date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 305 entries, 0 to 304
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date      305 non-null    datetime64[ns]
 1   year      305 non-null    int32
 2   quarter   305 non-null    int32
 3   month     305 non-null    int32
 4   week      305 non-null    UInt32
 5   day       305 non-null    int32
 6   day_name  305 non-null    object
 7   date_key  305 non-null    int64
dtypes: UInt32(1), datetime64[ns](1), int32(4), int64(1), object(1)
memory usage: 13.5+ KB

In [39]:
df_country = df[["country", "country_id"] ].drop_duplicates().sort_values(by="country_id")
df_country = df_country.reset_index(drop=True)
df_country["country_key"] = df_country.index
df_country.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   country      38 non-null     object
 1   country_id   38 non-null     object
 2   country_key  38 non-null     int64
dtypes: int64(1), object(2)
memory usage: 1.0+ KB

In [40]:
df_product = df[['product_id', "name", "price"]]
unique_product = df_product.drop_duplicates().sort_values(by=["name", "price"])
unique_product = unique_product.reset_index(drop=True)
unique_product["product_key"] = unique_product.index

df_unique_product = pd.merge(df_product, unique_product, on=["product_id", "name", "price"]).sort_values(by=["name", "price"]).drop_duplicates()
df_unique_product.info()

<class 'pandas.core.frame.DataFrame'>
Index: 23499 entries, 472730 to 185296
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   product_id   23499 non-null  object
 1   name         23499 non-null  object
 2   price        23499 non-null  float64
 3   product_key  23499 non-null  int64
dtypes: float64(1), int64(1), object(2)
memory usage: 917.9+ KB

### Join all to fact table

In [41]:
result = pd.merge(df, df_customer, on="customer_id")
result = pd.merge(result, df_transaction, on="transaction_id")
result = pd.merge(result, df_date, on=["date", "year", "quarter", "month", "week", "day", "day_name"])
result = pd.merge(result,df_country, on=["country_id", "country"])
result = pd.merge(result, df_unique_product, on=["product_id", "name", "price"])

In [42]:
result.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 517898 entries, 0 to 517897
Data columns (total 20 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   transaction_id   517898 non-null  int64
 1   date             517898 non-null  datetime64[ns]
 2   product_id       517898 non-null  object
 3   name             517898 non-null  object
 4   price            517898 non-null  float64
 5   customer_id      517898 non-null  int64
 6   country          517898 non-null  object
 7   quantity         517898 non-null  int64
 8   year             517898 non-null  int32
 9   quarter          517898 non-null  int32
 10  month            517898 non-null  int32
 11  week             517898 non-null  UInt32
 12  day              517898 non-null  int32
 13  day_name         517898 non-null  object
 14  country_id       517898 non-null  object
 15  customer_key     517898 non-null  int64
 16  transaction_key  517898 non-null  int64
 17  date_key         517898 non-null  int64
 18  country_key      517898 non-null  int64
 19  product_key      517898 non-null  int64
dtypes: UInt32(1), datetime64[ns](1), float64(1), int32(4), int64(8), object(5)
memory usage: 69.6+ MB

### Add col and Load dim table to postgres

In [43]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4719 entries, 0 to 4718
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   customer_id   4719 non-null   int64
 1   customer_key  4719 non-null   int64
dtypes: int64(2)
memory usage: 73.9 KB

In [44]:
df_customer_dim = df_customer.set_index("customer_key")
df_customer_dim.to_sql("customer_dim", con=engine, if_exists="replace")
with engine.connect() as conn:
    conn.execute(text("ALTER TABLE customer_dim ADD PRIMARY KEY (customer_key);"))
df_customer_dim.shape

(4719, 1)

In [45]:
df_transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19790 entries, 0 to 19789
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   transaction_id   19790 non-null  int64
 1   transaction_key  19790 non-null  int64
dtypes: int64(2)
memory usage: 309.3 KB

In [46]:
df_transaction_dim = df_transaction.set_index("transaction_key")
df_transaction_dim.to_sql("transaction_dim", con=engine, if_exists="replace")
with engine.connect() as conn:
    conn.execute(text("ALTER TABLE transaction_dim ADD PRIMARY KEY (transaction_key);"))
df_transaction_dim.shape

(19790, 1)

In [47]:
df_date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 305 entries, 0 to 304
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date      305 non-null    datetime64[ns]
 1   year      305 non-null    int32
 2   quarter   305 non-null    int32
 3   month     305 non-null    int32
 4   week      305 non-null    UInt32
 5   day       305 non-null    int32
 6   day_name  305 non-null    object
 7   date_key  305 non-null    int64
dtypes: UInt32(1), datetime64[ns](1), int32(4), int64(1), object(1)
memory usage: 13.5+ KB

In [48]:
df_date_dim = df_date.set_index("date_key")
df_date_dim['date'] = df_date_dim['date'].dt.date
df_date_dim.to_sql("date_dim", con=engine, if_exists="replace")
with engine.connect() as conn:
    conn.execute(text("ALTER TABLE date_dim ADD PRIMARY KEY (date_key);"))
df_date_dim.shape

(305, 7)

In [49]:
df_unique_product.info()

<class 'pandas.core.frame.DataFrame'>
Index: 23499 entries, 472730 to 185296
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   product_id   23499 non-null  object
 1   name         23499 non-null  object
 2   price        23499 non-null  float64
 3   product_key  23499 non-null  int64
dtypes: float64(1), int64(1), object(2)
memory usage: 917.9+ KB

In [50]:
df_product_dim = df_unique_product.set_index("product_key")
df_product_dim.to_sql("product_dim", con=engine, if_exists="replace")
with engine.connect() as conn:
    conn.execute(text("ALTER TABLE product_dim ADD PRIMARY KEY (product_key);"))
df_product_dim.shape

(23499, 3)

In [51]:
df_country.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   country      38 non-null     object
 1   country_id   38 non-null     object
 2   country_key  38 non-null     int64
dtypes: int64(1), object(2)
memory usage: 1.0+ KB

In [52]:
df_country_dim = df_country.set_index("country_key")
df_country_dim.to_sql("country_dim", con=engine, if_exists="replace")
with engine.connect() as conn:
    conn.execute(text("ALTER TABLE country_dim ADD PRIMARY KEY (country_key);"))
df_country_dim.shape

(38, 2)

### Remove col and Load fact table to postgres

In [53]:
result.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 517898 entries, 0 to 517897
Data columns (total 20 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   transaction_id   517898 non-null  int64
 1   date             517898 non-null  datetime64[ns]
 2   product_id       517898 non-null  object
 3   name             517898 non-null  object
 4   price            517898 non-null  float64
 5   customer_id      517898 non-null  int64
 6   country          517898 non-null  object
 7   quantity         517898 non-null  int64
 8   year             517898 non-null  int32
 9   quarter          517898 non-null  int32
 10  month            517898 non-null  int32
 11  week             517898 non-null  UInt32
 12  day              517898 non-null  int32
 13  day_name         517898 non-null  object
 14  country_id       517898 non-null  object
 15  customer_key     517898 non-null  int64
 16  transaction_key  517898 non-null  int64
 17  date_key         517898 non-null  int64
 18  country_key      517898 non-null  int64
 19  product_key      517898 non-null  int64
dtypes: UInt32(1), datetime64[ns](1), float64(1), int32(4), int64(8), object(5)
memory usage: 69.6+ MB

In [54]:
df_sales_fact = result[["customer_key", "transaction_key", "date_key", "product_key", "country_key", "quantity"]].sort_values(by="date_key")
df_sales_fact.to_sql("sales_fact", con=engine, if_exists="replace", index=False)

898

In [57]:
with engine.connect() as conn:
    conn.execute(text("""
    ALTER TABLE sales_fact 
    ADD PRIMARY KEY (customer_key, transaction_key, date_key, product_key, country_key);
    """))
    conn.execute(text("""
    ALTER TABLE sales_fact
    ADD CONSTRAINT fk_customer_dim_sales_fact
    FOREIGN KEY (customer_key)
    REFERENCES customer_dim (customer_key);
    """))
    conn.execute(text("""
    ALTER TABLE sales_fact
    ADD CONSTRAINT fk_transaction_dim_sales_fact
    FOREIGN KEY (transaction_key)
    REFERENCES transaction_dim (transaction_key);
    """))
    conn.execute(text("""
    ALTER TABLE sales_fact
    ADD CONSTRAINT fk_date_dim_sales_fact
    FOREIGN KEY (date_key)
    REFERENCES date_dim (date_key);
    """))
    conn.execute(text("""
    ALTER TABLE sales_fact
    ADD CONSTRAINT fk_product_dim_sales_fact
    FOREIGN KEY (product_key)
    REFERENCES product_dim (product_key);
    """))
    conn.execute(text("""
    ALTER TABLE sales_fact
    ADD CONSTRAINT fk_country_dim_sales_fact
    FOREIGN KEY (country_key)
    REFERENCES country_dim (country_key);
    """))

In [80]:
df_sales_fact.loc[
    df_sales_fact["transaction_key"] == 17238
]

,customer_key,transaction_key,date_key,product_key,country_key,quantity
319348,1340,17238,281,10380,34,5
416149,1340,17238,281,1260,34,1
377498,1340,17238,281,10448,34,5
374205,1340,17238,281,5607,34,5
251122,1340,17238,281,10339,34,10
...,...,...,...,...,...,...
216427,1340,17238,281,18959,34,2
324071,1340,17238,281,10243,34,11
478856,1340,17238,281,9696,34,1
210086,1340,17238,281,20371,34,17
249641,1340,17238,281,16574,34,2

In [81]:
result.loc[
    (result["customer_key"] == 1340) & 
    (result["product_key"] == 10380)
]

,transaction_id,date,product_id,name,price,customer_id,country,quantity,year,quarter,month,week,day,day_name,country_id,customer_key,transaction_key,date_key,country_key,product_key
319348,575947,2019-11-13,20711,Jumbo Bag Toys,7.24,13947,United Kingdom,5,2019,4,11,46,13,Wednesday,UNI14,1340,17238,281,34,10380

In [86]:
df_customer[
    df_customer["customer_key"] == 1340
]

      customer_id  customer_key
1340        13947          1340

In [90]:
df_unique_product.loc[
    df_unique_product["product_key"] == 10380
]

       product_id            name  price  product_key
289311      20711  Jumbo Bag Toys   7.24        10380

In [ ]:
import schedule
import time as tm
from datetime import time, timedelta, datetime



def job():
    print(df)


schedule.every(5).seconds.do(job)

while True:
    schedule.run_pending()
    tm.sleep(1)